[
    {
        "title": "Dental Receptionist/Front Desk Coordinator",
        "description": "<p>Dental Receptionist needed for growing private dental practice. We need an experienced, motivated person who will be warm and wonderful on the phone, has great customer service skills in person and on the phone, experience in dental front office systems including dental scheduling, is detailed oriented and is an excellent communicator and team player.</p>",
        "companyName": "Michael S Scurti DMD LLC",
        "companyUrl": null,
        "jobUrl": "https://www.ziprecruiter.com/jobs//j?lvk=0YMu_gE6XbhJ9r4uzTGW-A",
        "location": "Parsippany, NJ, USA",
        "publisher": "Glassdoor"
    },
    {
        "title": "Office Administrator Receptionist",
        "description": "<ul><li></li><p><strong>Bilingual: Fluent in English and Spanish</strong></p><li></li><p><strong>Communication: written and verbal communication skills</strong></p><li></li><p><strong>Team Player: Ability to collaborate effectively with others</strong></p><li></li><p><strong>Willingness to Learn new skills and grow professionally</strong></p><li></li><p><strong>Customer Service: Some Experience is preferred but not required in handling phone calls, emails, and walk-in clients</strong></p><li></li><p><strong>Social Media: Some Experience is preferred but not required </strong></p><li></li><p><strong>Office Administrative Support: Some Experience is preferred but not required </strong></p><li></li><p><strong>Part Time position or Full Time </strong></p></ul>",
        "companyName": "Access Homes Realty LLC",
        "companyUrl": null,
        "jobUrl": "https://www.ziprecruiter.com/jobs//j?lvk=dw0QRqyLJPR19Vc17zBfIQ",
        "location": "Union City, NJ, USA",
        "publisher": "Glassdoor"
    },
    {
        "title": "Receptionist/Clerk, Bronx",
        "description": "<p><strong>Receptionist/Clerk, Bronx</strong></p><p>We are currently seeking an experienced Bilingual<strong> (Spanish/English) </strong>Receptionist for a residential public housing Development in the Bronx.</p><p><strong>Position summary: </strong>Greet visitors, answer and forward calls, input/close repair work tickets, etc.</p><p><strong>Responsibilities</strong></p><p>&middot; Greet visitors at the front desk and attempt to assist them</p><p>&middot; Answer, screen, and forward incoming phone calls.</p><p>&middot; Assist visitors and callers with immediate needs pertaining to repair requests in apartment</p><p>&middot; Input work tickets into computer system, and follow through until repair complete</p><p>&middot; Schedule appointments with tenants for repair work</p><p>&middot; Perform other clerical receptionist duties such as filing, photocopying, faxing, etc.</p><p>&middot; Assist Resident Manager with sending out tenant notices</p><p><strong>Job Type</strong></p><p>&middot; Full Time</p><p>&middot; Non-Union</p><p><strong>Qualifications </strong></p><p>&middot; Experience of 3 years or more working in a property management or real estate office</p><p>&middot; Knowledge of Maximo computer system a plus</p><p>&middot; Previous experience working for a public housing authority a plus\\</p><p>&middot; <strong>Bilingual, Spanish and English</strong></p><p>&middot; Must be a team player used to working with deadlines</p><p>&middot; Polite with experience working in a customer service environment</p><p>&middot; Must have excellent time management skills</p><p>&middot; Must be reliable and have experience working with tenants</p><p>&middot; Computer knowledge of word, Microsoft, excel, etc.</p><p><strong>Hours </strong></p><p>&middot; 8:30 &ndash; 4:30</p>",
        "companyName": "A New York Real Estate Management Company",
        "companyUrl": null,
        "jobUrl": "https://www.ziprecruiter.com/jobs//j?lvk=CriCLHnyJFgZLbR1b_xAhw",
        "location": "Bronx, NY, USA",
        "publisher": "Glassdoor"
    },
    {
        "title": "Receptionist (Max $20/hr W2)",
        "description": "Company Description<br><br><p>Finance</p>Job Description<br><br><p>Seeking Receptionist who ideally has at least 2-3 years of experience working in a professional office environment.</p><p>Well-spoken individual who will be responsible to meet and greet clients, manage conference rooms (i.e., schedule rooms, make sure rooms are presentable before each meeting and help with zoom when needed).</p><p>Order supplies and keep supply rooms organized.</p><p>Will support several Senior and Junior employees with expenses, travel, calendar, meetings and catering.</p><p>Knowledge in Outlook, Concur and booking domestic/international travel.</p><p>Must possess excellent written and oral communication skills. Must dress professionally.</p>Additional Information<br><br><p>All your information will be kept confidential according to EEO guidelines.</p>",
        "companyName": "Lenmar Consulting Inc.",
        "companyUrl": null,
        "jobUrl": "https://www.ziprecruiter.com/jobs//j?lvk=jd5wwgGPQGVcG1mzSceiSw",
        "location": "New York, NY, USA",
        "publisher": "Glassdoor"
    },
    {
        "title": "Clinical Receptionist",
        "description": "<p><strong>Summary</strong></p><p>This position is primarily responsible for maintaining front desk operations, serving as the first point of contact in reception for youth, families and adults accessing treatment and other supportive services, operating a multi-line telephone system directing callers to appropriate personnel and treatment/recovery departments, assuring proper direction and registering of participants as well as accepting payments for services rendered. The Receptionist II reports directly to the Program Manager.</p><p> </p><p><strong>Essential Duties and Responsibilities:</strong></p><p>Core duties and responsibilities include the following. Other duties may be assigned.</p><p> </p><ul><li>Greets participants and all visitors, ascertaining purpose of visit and directing them accordingly. </li><li>Answers and screens incoming calls in a professional manner while providing assistance and obtaining accurate information.</li><li>Triages calls for clinic staff.</li><li>Provides callers and visitors with traveling directions and organizational information for accessing treatment options. </li><li>Monitors the waiting rooms to ensure the safety and progression of appointments is maintained.</li><li>Uses the electronic health record to check participants in. </li><li>Collects, records, tracks and monitors payments and provides receipts.</li><li>Manages MetroCard state reimbursement account for treatment participants. </li><li>Provides administrative and clerical support, including but not limited to, photocopying, faxing correspondence, creating letters to external sources, updating forms, stamping/mailing letters, ordering supplies and any other duties required by clinic, supervisory and executive staff. </li><li>Follows and adheres to state, local, federal and agency confidentiality policies and procedures protecting the confidentiality of participant protected health care information and ensures all transactions are conducted with respect and promotes the participant&rsquo;s privacy. </li><li>Provides culturally competent services in accordance with Elmcor&rsquo;s policies and procedures. </li><li>All other assigned tasks.</li></ul><p><strong>QUALIFICATIONS: </strong></p><p>To perform this job successfully, an individual must be able to perform each essential duty satisfactorily. The requirements listed below are representative of the knowledge, skill, and/or ability required. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.</p><p><strong>EDUCATION AND/OR EXPERIENCE: </strong><strong> </strong></p><p>Associates Degree in Secretarial Science or</p><p>High school diploma or general education degree (GED) with 3 years related work experience.</p><p><br></p>",
        "companyName": "Elmcor Youth & Adult Activities Inc",
        "companyUrl": null,
        "jobUrl": "https://www.ziprecruiter.com/jobs//j?lvk=cmqZcAUBZaZ2IkDngp59Dw",
        "location": "Saint Albans, NY, USA",
        "publisher": "Glassdoor"
    },
    {
        "title": "Receptionist",
        "description": "<p>Wavecrest Management is looking for a <strong>Receptionist</strong> located in Richmond Hills, NY.</p><p><strong>Essential Duties and Responsibilities:</strong></p><ul><li>Review all mail in applications and input on the master waiting list</li><li>Scan all mail in applications</li><li>Mail out applications if necessary</li><li>Scheduling and reserving conference room when necessary</li><li>Attend to tenants&rsquo; inquiries at the front reception</li><li>In charge of answering applicants/tenants&rsquo; calls and provide assistance</li><li>Sort and distribute Re-rental mails twice a week</li><li>Log lottery building(s) applications and mailing them out when necessary</li><li>Sort and distribute incoming mails to the appropriate person</li></ul><p><strong>Required Knowledge, Skills, and Abilities:</strong></p><ul><li>High School Diploma/GED with some college.</li><li>Proficiency in Microsoft Office &amp; excel Exceptional organization skills.</li><li>Great verbal and written communication skills.</li><li>Proactive work ethic and attention to detail.</li><li>Must be upbeat, polite, courteous and tactful.</li><li>Superior Customer Service skills required.</li><li>Proven ability to operate selflessly as part of a dynamic team.</li><li>Proven ability to multi task.</li><li>Able to work independently or under direct supervision.</li><li>Must have Property Management knowledge</li><li>Bilingual ( English-Spanish) REQUIRED</li></ul><p><strong>Why work for Wavecrest?</strong></p><ul><li>Personal growth opportunities with a consistently growing company!</li><li>Paid holiday, vacation and sick time.</li><li>Tiered Medical, Dental, Vision Insurance plans offered.</li><li>Commuter benefits if applicable.</li><li>On-site parking offered once qualified.</li></ul><p> </p><p>Employees must fulfill the performance standards of this position and comply with policies, rules, and procedures of the company, including those set out in the Employee Handbook, or otherwise communicated (verbally or in writing) to employees.</p><p> </p><p>Wavecrest Management provides equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, color, religion, sex, national origin, age, disability, genetics. In addition to federal law requirements, Wavecrest Management complies with applicable state and local laws governing nondiscrimination in employment in every location in which the company has facilities. This policy applies to all terms and conditions of employment, including recruiting, hiring, placement, promotion, termination.</p>",
        "companyName": "Wavecrest Management",
        "companyUrl": null,
        "jobUrl": "https://www.ziprecruiter.com/jobs//j?lvk=dFMbh6_PIr0ZA7oKSajIYw",
        "location": "New York, NY, USA",
        "publisher": "Glassdoor"
    },
    {
        "title": "Front Desk Call Receptionist",
        "description": "<p><strong>Ezra Medical Center is a multi-specialty organization that has been caring for the local community for over 18 years now.</strong></p><p><strong>Front Desk Responsibilities include</strong>:</p><ul><li>&middot; Processing patient information upon arrival.</li><li>&middot; Scheduling appointments</li><li>&middot; Verifying insurance</li><li>&middot; Obtaining prior authorizations</li></ul><p><strong>Front Desk Minimal Qualifications:</strong></p><ul><li>&middot; High school diploma or GED</li><li>&middot; Previous experience in a professional setting (medical setting preferred).</li><li>&middot; Good communication skills/ People skills</li><li>&middot; Knowledge of Microsoft office</li></ul><p><strong>Front Desk Benefits</strong></p><ul><li>&middot; Paid Time Off</li><li>&middot; Holiday Pay</li><li>&middot; Health Insurance</li><li>&middot; Dental Insurance</li><li>&middot; Disability Insurance</li><li>&middot; Life Insurance</li><li>&middot; FSA Account</li><li>&middot; Pension</li></ul>",
        "companyName": "Ezra Medical Center",
        "companyUrl": null,
        "jobUrl": "https://www.ziprecruiter.com/jobs//j?lvk=onjQdrT62W3N5pmKQE3mfw",
        "location": "Brooklyn, NY, USA",
        "publisher": "Glassdoor"
    },
    {
        "title": "Front Desk Receptionist",
        "description": "<div><br></div><div><strong>Position Overview:</strong><br> Counseling for Your is seeking a dynamic and organized <strong>Front Desk Receptionist</strong> to be the welcoming face and voice of our practice. As the first point of contact for our clients, you will play a key role in ensuring smooth communication, excellent client care, and operational efficiency.<br><br></div><div><strong>Key Responsibilities:</strong></div><ul><li>Serve as the primary contact for incoming calls with professionalism and empathy.</li></ul><div><strong><br> Qualifications:</strong></div><ul><li>Strong verbal and written communication skills.</li><li>A friendly and approachable personality, with a focus on creating a positive client experience.</li></ul><div><br></div><div>If you are an organized, empathetic, and proactive professional looking to make a difference in people&rsquo;s lives through exceptional client care, we encourage you to apply.</div><div><br></div><div><strong>Pay Range:</strong></div><div>$18-$20/hour experience pending<strong><br> <br> Shifts Needed: </strong>part-time and full-time positions, multiple shifts available</div><div>Monday through Friday<br>1-9pm or 4-9pm <br> <br>Sat/Sun</div><div>9-5pm </div><div><br></div><div><strong>Locations Needed:</strong></div><div>Merrick, NY</div><div>Massapequa, NY</div>",
        "companyName": "Counseling For You",
        "companyUrl": null,
        "jobUrl": "https://www.ziprecruiter.com/jobs//j?lvk=1tS_9DJ3S6tO85A-iL938w",
        "location": "Merrick, NY, USA",
        "publisher": "Glassdoor"
    },
    {
        "title": "Receptionist - Operations",
        "description": "Shift Schedule: Monday-Friday: 9AM-5PM Hours Per Week: 35 Duties and Responsibilities: * Greet and receive visitors, directing them to the appropriate staff. * Answer telephone calls and route calls&nbsp;...",
        "companyName": "Jewish Association for Services for the Aged",
        "companyUrl": null,
        "jobUrl": "https://www.ziprecruiter.com/jobs//j?lvk=8hgK8JSIzDEsAIJ_NOnFNw",
        "location": "New York, NY, USA",
        "publisher": "Glassdoor"
    },
    {
        "title": "Medical Receptionist",
        "description": "<div><em>We are looking for a medical receptionist who is a responsible, reliable, friendly, highly motivated team player individual to work in an internal medicine practice in the Bronx. Responsibilities include:<br></em><br></div><div>Greets patients and provides the necessary paperwork for completion<br><br></div><div>Obtains current patient demographic information and enters the information into the EMR system (MDLand)<br><br></div><div>Scans insurance cards for all new patients and cards for new insurance of established patients<br><br></div><div>Collect emails and informs patients of Patient Portal access<br><br></div><div>Verifying and collecting co-pays<br><br></div><div>Provide letters for the patients.<br><br></div><div>Assist with busy phone lines.<br><br></div><div>Assist patients with disabilities to fill out the necessary paperwork.<br><br></div><div>Schedule/reschedule patient appointments.<br><br></div><div>Take the initiative to assist other staff with scanning, faxing, etc.<br><br></div><div>Translating for patients and physician&#39;s<br><br></div><div>Compliant with HIPAA.<br><br><strong>***Bilingual in English and Spanish a must***</strong><br><br></div><div>Job Type: Full-time<br><br></div><div>Salary: $19.00 per hour</div>",
        "companyName": "VSVL Medical Services PLLC",
        "companyUrl": null,
        "jobUrl": "https://www.ziprecruiter.com/jobs//j?lvk=PuorblAYCS-Kul3_qk-QNw",
        "location": "Bronx, NY, USA",
        "publisher": "Glassdoor"
    },
    {
        "title": "Medical Receptionist",
        "description": "<p>Medical Receptionist needed for a busy Gynecologist office.</p><ul><li>2+ years&rsquo; experience</li></ul><ul><li>Ability to handle a fast-paced environment and prioritize tasks based on importance</li></ul><ul><li>Excellent communication and problem solving skills</li></ul><ul><li>Familiarity with Microsoft Office and EMR software</li><li>Hourly Rate Pay + Weekly Incentives</li></ul>",
        "companyName": "VCARE OBGYN P.C.",
        "companyUrl": null,
        "jobUrl": "https://www.ziprecruiter.com/jobs//j?lvk=rjtpcnZEhIlx2pPG3fiujg",
        "location": "Queens, NY, USA",
        "publisher": "Glassdoor"
    },
    {
        "title": "DENTAL  FRONT DESK RECEPTIONIST",
        "description": "<strong>Benefits:</strong><br><ul><li>401(k) matching</li><li>Bonus based on performance</li><li>Competitive salary</li><li>Paid time off</li></ul><br> Dental office in Park Slope, Brooklyn looking for front desk receptionist with great communication skills.<br><br>The candidate has to be familiar with insurance verification, patients data entry, scheduling appointments in Dentrix. Billing and collection experience is a great plus. Experience as dental receptionist required. We gladly offer flexible hours 3-4 days per week, paid vacations, paid holidays, sick days, bonuses and pension plan.<br>Come and join our wonderful team!<br><br>",
        "companyName": "GENTLE DENTAL ASSOCIATES LLC",
        "companyUrl": null,
        "jobUrl": "https://www.ziprecruiter.com/jobs//j?lvk=kJFTzR77Ppo0OWO_vXOp_w",
        "location": "New York, NY, USA",
        "publisher": "Glassdoor"
    },
    {
        "title": "Receptionist",
        "description": "<strong>About Client:</strong><br>Client is a global financial services firm that provides a wide range of investment banking, securities, wealth management, and investment management services. It is a prominent global financial services firm with a rich history and a strong presence in the financial industry.<br>The Client is committed to corporate responsibility and sustainability. It aims to make a positive impact on society through various initiatives, such as promoting environmental sustainability, supporting diversity and inclusion, and engaging in philanthropic activities.<br><br><strong>Rate: $20.74/Hr<br><br>Job Description:</strong><ul><li>Seeking Receptionist who ideally has at least 2-3 years of experience working in a professional office environment. </li><li>Well-spoken individual who will be responsible to meet and greet clients, manage conference rooms (i.e., schedule rooms, make sure rooms are presentable before each meeting and help with zoom when needed). </li><li>Order supplies and keep supply rooms organized. </li><li>Will support several Senior and Junior employees with expenses, travel, calendar, meetings and catering. </li><li>Knowledge in Outlook, Concur and booking domestic/international travel. </li><li>Must possess excellent written and oral communication skills.</li><li>Must dress professionally.</li></ul><br><br>Non-benefitted (other than those mandated under state or federal law).Please note that this position does not include paid time off benefits. ApTask offers subsidized insurance coverage to our employees.<br><br><strong>About ApTask:</strong><br>ApTask is a leading global provider of workforce solutions and talent acquisition services, dedicated to shaping the future of work. As an African American-owned and Veteran-certified company, ApTask offers a comprehensive suite of services, including staffing and recruitment solutions, managed services, IT consulting, and project management. With a focus on excellence, collaboration, and innovation, ApTask provides unparalleled opportunities for professional growth and development. As a member of the ApTask team, you will have the chance to connect businesses with top-tier professionals, optimize workforce performance, and drive success across diverse industries. Join us at ApTask and be part of our mission to empower organizations to thrive while fostering a diverse and inclusive work environment.<br><br>Applicants may be required to attend interviews in person or by video conference. In addition, candidates may be required to present their current state or government issued ID during each interview.<br><br><strong>Candidate Data Collection Disclaimer:</strong><br>At ApTask, we prioritize safeguarding your privacy. As part of our recruitment process, certain Personally Identifiable Information (PII) may be requested by our clients for verification and application purposes. Rest assured, we strictly adhere to confidentiality standards and comply with all relevant data protection laws. Please note that we only collect the necessary information as specified by each client and do not request sensitive details during the initial stages of recruitment.<br><br>If you have any concerns or queries about your personal information, please feel free to contact our compliance team at businessexcellence@aptask.com<br><br><strong>Applicant Consent:</strong><br>By submitting your application, you agree to ApTask&#39;s (www.aptask.com) Terms of Use and Privacy Policy, and provide your consent to receive SMS and voice call communications regarding employment opportunities that match your resume and qualifications. You understand that your personal information will be used solely for recruitment purposes and that you can withdraw your consent at any time by contacting us at 732-355-8000 or help@aptask.com. Message frequency may vary. Msg &amp; data rates may apply.<br>",
        "companyName": "ApTask",
        "companyUrl": null,
        "jobUrl": "https://www.ziprecruiter.com/jobs//j?lvk=NT6ic56DqhtSDhZGHmWnLQ",
        "location": "New York, NY, USA",
        "publisher": "Glassdoor"
    },
    {
        "title": "DENTAL RECEPTIONIST",
        "description": "<div>FULL TIME FRONT DESK DENTAL RECEPTIONIST FOR SOLO PRIVATE PRACTICE.<br>MUST HAVE EXPERIENCE WITH DENTAL SOFTWARE. ENGLISH AND SPANISH SPEAKING A MAJOR PLUS.<br>DUTIES INCLUDE ANSWERING PHONES, MAKING APPOINTMENTS, REGISTERING PATIENTS, VERIFYING INSURANCE, SCANNING DOCUMENTS, CONTACTING PATIENTS TO SCHEDULE APPOINTMENTS, AND CALLING TO CONFIRM APPOINTMENTS.<br>POSITION IS AVAILABLE IMMEDIATELY. PRESENT RECEPTIONIST WILL PROVIDE TRAINING AND IS AVAILABLE TILL MAY.<br>THE SALARY RANGE IS $20-$24/HR. THERE ARE NO WEEKEND HOURS. <br>MONDAY WEDNESDAY AND FRIDAY 8:30-4:00. <br>TUESDAY AND THURSDAY 9:00-6:00. <br>THE OFFICE IS CLOSED THE 2ND FRIDAY OF EVERY MONTH. <br>FROM MEMORIAL DAY TILL LABOR DAY WE WORK MONDAY TO THURSDAY 9:00-6:00 AND WE TAKE 3 DAY WEEKENDS.<br>EMPLOYEES RECEIVE 1 WEEK SICK DAYS PER YEAR<br>EACH YEAR 1 WEEK PAID VACATION TO A MAXIMUM OF 3 WEEKS PAID VACATION AFTER 3 YEARS.<br>PAID HOLIDAYS.<br>OVERTIME IS TIME AND A HALF.<br>THE OFFICE ALSO HAS A QUALIFIED PENSION PROFIT SHARING PLAN THAT YOU DO NOT CONTRIBUTE TO, IT COMES FROM THE PRACTICE.<br>THE OFFICE ONLY SEES PRIVATE AND INSURANCE PATIENTS - NO MEDICAID.<br>PATIENTS AND STAFF ARE PLEASANT AND FRIENDLY.<br>YEAR END X-MAS PARTY AND $$ BONUSES.</div>",
        "companyName": "Robert Garfinkel DMD",
        "companyUrl": null,
        "jobUrl": "https://www.ziprecruiter.com/jobs//j?lvk=ghMQrgdzt_wPQccqqtUaUA",
        "location": "BRONX, NY, USA",
        "publisher": "Glassdoor"
    },
    {
        "title": "Senior Medical Receptionist",
        "description": "<p>Boutique OB/GYN practice in Manhattan looking for an experienced pleasant and intelligent individual who has good communication skills and computer skills to work as a full time medical receptionist.</p><p>Job Duties include:</p><ul><li>Managing <strong>high volume</strong> phones</li><li>Greeting patients</li><li>Making appointments</li><li>Checking insurance coverage</li><li>Scanning and filing</li><li>Anticipating physician and patient needs</li></ul><p>Medical receptionist experience required. Ob/gyn experience preferred. Position is available immediately.</p><p>Hours: Monday - Friday. Hours may vary.<br>Salary: $22+/hr. based on experience.</p>",
        "companyName": "Manhattan Women's Health",
        "companyUrl": null,
        "jobUrl": "https://www.ziprecruiter.com/jobs//j?lvk=HlgXeUUxw46xW58V9EOCaw",
        "location": "New York, NY, USA",
        "publisher": "Glassdoor"
    },
    {
        "title": "Full-time Dental office receptionist",
        "description": "<div>We are looking for an <strong>Experienced Dental Receptionist</strong> to become a valued member of our team!<br><br></div><div><strong>Responsibilities:<br></strong><br></div><ul><li>Greet and assist patients in a friendly and welcoming manner.</li><li>Answer phones, schedule appointments, and manage patient records.</li><li>Verify insurance details and handle billing inquiries.</li><li>Maintain a smooth flow of the office and ensure efficient patient intake.</li><li>Coordinate with dental staff to ensure timely care.</li></ul><div><strong>Requirements:<br></strong><br></div><ul><li><strong><em>Minimum 2 years</em></strong><strong> </strong>of experience in a dental office or setting.</li><li>Strong knowledge of dental terminology and insurance processes (PPO insurances.)</li><li>Excellent communication and multitasking skills.</li><li>Ability to work independently and as part of a team.</li><li>Proficient with dental software and office tools.</li><li>fluent in English and Spanish</li></ul><div><strong>Schedule:<br>Mon-Thurs 9am-5pm<br>Fri 8am-3pm<br>Every other Sat 8am-2pm</strong></div><div><br></div><div>If you&rsquo;re looking for a rewarding career with a dynamic team, we&rsquo;d love to hear from you!<br><br></div><div><strong>To apply, send your resume to blvddentalpc@gmail.com or call 201-453-2300<br></strong></div>",
        "companyName": "Blvd Dental Pc",
        "companyUrl": null,
        "jobUrl": "https://www.ziprecruiter.com/jobs//j?lvk=R12uaIgljozANO0C-7nbow",
        "location": "West New York, NJ, USA",
        "publisher": "Glassdoor"
    },
    {
        "title": "Medical Front Desk Receptionist",
        "description": "<p>UNITY Chiropractic Wellness is seeking an on-site Front Desk Receptionist for our medical clinic located in Midtown Manhattan, New York. We are one block from grand central. (Full time)</p><p>Excellent entry level position with opportunity to grow professionally. Looking for a team member eager to learn more about all aspects of medical business administration from our experienced managers, and eventually grow to take on more challenging tasks.</p><p>Compensation: Starting at $19-22 an hour, more with experience.<br>Hours: <br>8:30am-5:30pm Mondays and Wednesdays<br>10:30am-7:30 Tuesdays Thursdays<br>8:00am-5:00pm Friday (Full time= 5 days a week)<br>Benefits: Medical, Dental, Vision, 401k, and Paid time Off available for full time employees.</p><p>Patient Experience Champion:<br>Greet patients warmly and professionally<br>Check patients in and out while monitoring important patient and insurance information<br>Collect copayments and patient checks as needed<br>Answer phone calls, respond to emails, and schedule appointments while maintaining a positive and helpful demeanor.<br>Address patient inquiries and concerns with empathy and a solutions-oriented approach.<br>Scanning and Updating accounts<br>Maintaining rooms and supplies stocked and organized</p><p>Team Player:<br>Partner with virtual assistants to work on assigned tasks and projects<br>Assist with monitoring office supplies and remain mindful of any needed preventative maintenance services.<br>Monitor the schedule to ensure smooth patient flow throughout the day.<br>Participate in onboarding and training new staff.</p><p>Administrative Support:<br>Assist doctors with creating letters, notes, and patient outreach when needed.<br>Work with practice manager to ensure that any issues that may arise are addressed and resolved<br>Assist with additional tasks and projects as assigned</p><p>Follow us on instagram: @unitychirowellness</p>",
        "companyName": "UNITY Chiropractic Wellness",
        "companyUrl": null,
        "jobUrl": "https://www.ziprecruiter.com/jobs//j?lvk=55ts8S5j6mmdXaYqLSvsOw",
        "location": "Manhattan, NY, USA",
        "publisher": "Glassdoor"
    },
    {
        "title": "Showroom Front Desk Receptionist",
        "description": "<div><strong>Job description<br></strong><br></div><div></div><div>A fashion apparel company is seeking an In-House Front Desk Receptionist who can join us as a member of our team. The Front Desk Receptionist will be responsible for greeting customers and maintaining the showroom organized. The ideal candidate for this position is outgoing, friendly, and able to work with a wide variety of people from varying backgrounds.<br><br><strong>Responsibilities:</strong></div><ul><li>Greet visitors and clients professionally and courteously.</li><li>Maintain a clean and organized showroom, ensuring a positive first impression.</li><li>Organize and manage samples to ensure they are easily accessible.</li><li>Answer and direct incoming phone calls promptly and efficiently.</li><li>Fulfill supply requests and keep inventory well-stocked.</li><li>Perform basic data entry tasks with accuracy.</li></ul><div><br></div><div><strong>Requirements</strong></div><ul><li>High school diploma or equivalent required.</li><li>Excellent communication and interpersonal skills.</li><li>Strong organizational skills and attention to detail.</li><li>Ability to multitask and manage time effectively.</li><li>Basic computer skills, including familiarity with data entry software.</li><li>A professional and positive demeanor.</li></ul>",
        "companyName": "IBERIA FASHION LLC",
        "companyUrl": null,
        "jobUrl": "https://www.ziprecruiter.com/jobs//j?lvk=Ny1bNe9iCpr8AmYxXqK8qQ",
        "location": "NEW YORK, NY, USA",
        "publisher": "Glassdoor"
    },
    {
        "title": "Dental Receptionist - Front Desk",
        "description": "<div>Looking for a full time or part time front desk receptionist for a busy general practice office. Person has to be energetic, team player, positive attitude, self-motivated and a well-spoken individual.<br><br></div><div>Duties include but not limited to answering phones, checking in patients, manage schedule, confirming appointments, collect copays and outstanding balances, verify insurance/breakdown of dental benefits, checking pre-authorizations and inputting patient information into the computer.<br><br></div><div>Experienced, Insurance knowledge and Bi-lingual is a plus</div>",
        "companyName": "MASPETH DENTAL HL PC",
        "companyUrl": null,
        "jobUrl": "https://www.ziprecruiter.com/jobs//j?lvk=Gte0kdQ1dJRzPmWO3DddOA",
        "location": "Maspeth, NY, USA",
        "publisher": "Glassdoor"
    },
    {
        "title": "Ophthalmic Receptionist",
        "description": "<div><strong>Benefits/Perks</strong></div><ul><li>Competitive Compensation</li><li>Great Work Environment</li></ul><div><strong>Job Summary</strong></div><div>We are a private ophthalmology practice with 3 physicians in search of an experienced medical receptionist to join our team. The ideal candidate is very organized, has strong customer service and interpersonal skills, and works well independently and within a team.</div><div><br></div><div><strong>Responsibilities </strong></div><ul><li>Greet patients who enter the practice, filtering their needs as necessary</li><li>Answering a high volume of calls throughout the day</li><li>Verifying insurance information of established and new patients alike</li><li>Scheduling of appointments for patients following a scheduling templates</li><li>Faxing and emailing documentation as required</li><li>Collecting copays, as well as outstanding balances of patients</li><li>Maintaining appropriate workflow via manipulation of digital EMR, scheduling system, and physical patient charts</li><li>Prepping intake forms and charts for new patients</li><li>Sending prescriptions for patients at the direction of doctor(s), and refilling prescriptions based on patient need</li></ul><div><strong>Qualifications</strong></div><ul><li>2 years of medical office experience</li><li>Excellent organizational skills</li><li>Attention to detail</li><li>Strong front-end facing skills</li><li>Ability to multitask in a fast-paced environment</li><li>Comfortable with and skilled at functioning within a team setting</li><li>Familiarity with basic computer tasks, Mac preferred</li><li>Familiarity with ophthalmic terminology preferred</li></ul>",
        "companyName": "Sidney Mandelbaum",
        "companyUrl": null,
        "jobUrl": "https://www.ziprecruiter.com/jobs//j?lvk=zp1e9l-VMOWEjPWE3u_6gw",
        "location": "New York, NM, USA",
        "publisher": "Glassdoor"
    }
]